In [1]:
## 1. Create and display a pandas series containing the first 5 prime numbers

import pandas as pd
prime_ser = pd.Series([2,3,5,7,11])
print(prime_ser)

0     2
1     3
2     5
3     7
4    11
dtype: int64

In [2]:
## 2. Create two series of first 5 prime numbers and first 5 composite numbers respectively, and perform multiplication on both

prime_ser = pd.Series([2,3,5,7,11])
comp_ser = pd.Series([4,6,8,9,10])
prod_ser = prime_ser * comp_ser
print(prod_ser)

0      8
1     18
2     40
3     63
4    110
dtype: int64

In [3]:
## 3. Retrieve the 3rd and 4th series elements from the composite number series created in the previous question

print(comp_ser[2:4])

2    8
3    9
dtype: int64

In [4]:
## 4. Add the composite number series created to the prime number series

num_ser = prime_ser.append(comp_ser)
print(num_ser)

0     2
1     3
2     5
3     7
4    11
0     4
1     6
2     8
3     9
4    10
dtype: int64

In [5]:
## 5. From the prime number series created in Q1, remove the even prime number

new_prime_ser = prime_ser.drop(0)
print(new_prime_ser)

1     3
2     5
3     7
4    11
dtype: int64

In [6]:
## 6. Create a dataframe of five employees with their monthly salary from a dictionary of lists

emp_sal = {'Name':['Anna','John','Smith','Jessie','Shawn'], 'Salary':[600,756,587,859,990]}
df = pd.DataFrame(emp_sal)
df

     Name  Salary
0    Anna     600
1    John     756
2   Smith     587
3  Jessie     859
4   Shawn     990

In [7]:
## 7. From the employee dataframe created in Q7, extract the salary column alone

df['Salary']

0    600
1    756
2    587
3    859
4    990
Name: Salary, dtype: int64

In [8]:
## 8. Revise the column names of the employee dataframe to "First_Name" and "Monthly_Salary"

df.rename(columns={'Name':'First_Name','Salary':'Monthly_Salary'}, inplace=True)
df

  First_Name  Monthly_Salary
0       Anna             600
1       John             756
2      Smith             587
3     Jessie             859
4      Shawn             990

In [9]:
## 9. Read the csv file called "starbucks_final" into a pandas dataframe, and display the first five records

starbucks_df = pd.read_csv("starbucks_final.csv")
starbucks_df.head()

               Name  Calories   Fat  Carb  Fiber  Protein
0      Chonga Bagel       300   5.0    50      3       12
1      8-Grain Roll       380   6.0    70      7       10
2  Almond Croissant       410  22.0    45      3       10
3     Apple Fritter       460  23.0    56      2        7
4  Banana Nut Bread       420  22.0    52      2        6

In [10]:
## 10. Print the descriptive statistics of the starbucks dataframe

starbucks_df.describe()

         Calories         Fat        Carb       Fiber     Protein
count  112.000000  112.000000  112.000000  112.000000  112.000000
mean   359.017857   16.500000   41.642857    2.839286   11.562500
std    125.740759    8.187554   15.779938    2.899374    8.442472
min     90.000000    1.000000    5.000000    0.000000    1.000000
25%    280.000000    9.000000   31.750000    1.000000    5.000000
50%    360.000000   17.000000   42.500000    2.000000    8.500000
75%    452.500000   23.000000   53.000000    3.000000   19.000000
max    650.000000   37.000000   80.000000   21.000000   34.000000

In [11]:
## 11. Change the data type of "Fat" column from float to int

starbucks_df['Fat'] = starbucks_df['Fat'].astype('int64')
starbucks_df.dtypes

Name        object
Calories     int64
Fat          int64
Carb         int64
Fiber        int64
Protein      int64
dtype: object

In [12]:
## 12. Retrieve the 5th record pertaining to the "Fiber" column alone the starbucks dataframe

starbucks_df.iloc[[4]]['Fiber']

4    2
Name: Fiber, dtype: int64

In [13]:
## Alternatively, using loc

starbucks_df.loc[[4]]['Fiber']

4    2
Name: Fiber, dtype: int64

In [14]:
## end of notebook